CSI API ETABS v1

# cFrameObjGetSelected Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetSelected(
    	string Name,
    	ref bool Selected
    )

    Function GetSelected (
    	Name As String,
    	ByRef Selected As Boolean
    ) As Integer

    Dim instance As cFrameObj
    Dim Name As String
    Dim Selected As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetSelected(Name,
    	Selected)

    int GetSelected(
    	String^ Name,
    	bool% Selected
    )

    abstract GetSelected :
            Name : string *
            Selected : bool byref -> int

#### Parameters

Name

    Type: SystemString

Selected

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cFrameObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com